// Напишите программу, которая на вход принимае число и выдаёт его квадрат 

 Console.Write("Введите целое число: ");
 int number = Convert.ToInt32(Console.ReadLine());
 Console.WriteLine($"Квадрат введённого Вами числа {number} равен {number * number}");
   